[
    {
      "id": "1",
      "title": "Coding Interviews Are Broken",
      "channel": "WiiWatch",
      "image": "https://img.youtube.com/vi/vHKzIPwWQkg/0.jpg",
      "description": "Algorithm style coding interviews are very common in the tech industry, but they are a crappy method to evaluate candidates. Might work well for FANG (Facebook, Amazon, Netflix, Google), but the rest of the tech companies are throwing away valid applicants.",
      "views": "0",
      "likes": "0",
      "duration": "00:06:03",
      "genre": "tech",
      "video": "https://www.youtube.com/embed/bx3--22D4E4?start=",
      "showing": "2021-07-19 21:38:10",
      "time": "13:37:20",
      "language": "English",
      "year": "2021"
    },
    {
        "id": "2",
        "title": "Manchester City vs. Chelsea",
        "channel": "WiiWatch",
        "image": "https://img.youtube.com/vi/vEEi1CVq_wY/0.jpg",
        "description": "FULL MATCH | Manchester City vs. Chelsea (UEFA Champions League Final 2020-21)",
        "views": "0",
        "likes": "0",
        "duration": "2:33:10",
        "genre": "sports",
        "video": "https://www.youtube.com/embed/vEEi1CVq_wY?start=",
        "showing": "2021-07-19 21:36:20",
        "time": "13:37:20",
        "language": "English",
        "year": "2021"
      },
      {
        "id": "3",
        "title": "Bodied",
        "channel": "WiiWatch",
        "image": "https://img.youtube.com/vi/IKmE7O6I2NA/0.jpg",
        "description": "A biting satire set in the world of competitive battle rap, BODIED is the story of Adam Merkin, a progressive grad student who becomes an accidental battle rapper after encountering Behn Grymm, a respected icon in the merciless sub-culture of poetic personal insults. As Adam makes his politically-incorrect climb up the ranks, he risks alienating his father, a renowned writer and tenured professor at Adam's university, along with his skeptical girlfriend Maya, and all of his academic friends. His success breeds outrage however; Adam soon faces growing backlash on campus and comes to understand the importance (and cost) of free speech.",
        "views": "0",
        "likes": "0",
        "duration": "2:00:28",
        "genre": "music",
        "video": "https://www.youtube.com/embed/7hyBTKv6mhk?start=",
        "showing": "2021-07-19 20:37:20",
        "time": "13:37:20",
        "language": "English",
        "year": "2021"
      },
      {
        "id": "4",
        "title": "Fr. Mike Schmitz: 'The Hour That Will Change Your Life' | SEEK2015",
        "channel": "WiiWatch",
        "image": "https://img.youtube.com/vi/LwwiIkrLxTM/0.jpg",
        "description": "Fr. Mike Schmitz shares his experiences and the true intimacy that the Lord offers us in the Eucharist.",
        "views": "0",
        "likes": "0",
        "duration": "00:45:48",
        "genre": "religion",
        "video": "https://www.youtube.com/embed/LwwiIkrLxTM?start=",
        "showing": "2021-07-20 19:55:20",
        "time": "19:55:20",
        "language": "English",
        "year": "2021"
      },
      {
        "id": "5",
        "title": "Why Be Catholic and Not Just Christian?",
        "channel": "WiiWatch",
        "image": "https://img.youtube.com/vi/jJCbCs-y1_k/0.jpg",
        "description": "There are many similarities and differences between the Catholic Church and the Protestant denominations. In this video, Fr. Mike Schmitz narrows the differences down to one thing that really sets Catholicism apart from other Christian Churches: authoritative teaching.",
        "views": "0",
        "likes": "0",
        "duration": "00:08:58",
        "genre": "religion",
        "video": "https://www.youtube.com/embed/jJCbCs-y1_k?start=",
        "showing": "2021-07-20 13:37:20",
        "time": "13:37:20",
        "language": "English",
        "year": "2021"
      },
      {
        "id": "6",
        "title": "Fr. Mike Schmitz: Anti-Fragile Faith | SEEK2019",
        "channel": "WiiWatch",
        "image": "https://img.youtube.com/vi/yDnXk5iiCxM/0.jpg",
        "description": "Christian faith and Christian joy are more than mere feelings. Faith is confidence in the Person and promises of God. Joy is the sense of well- being that is the fruit of something else. It is the fruit of a life lived in God. A life “lived in God” is eminently practical. If a person lives their anti-fragile faith in every environment, one can experience the joy that thrives in any environment. Fr. Michael Schmitz is the director of youth and young adult ministry for the Diocese of Duluth and chaplain for the Newman Center at the University of Minnesota-Duluth. Father Mike provides podcasts of his weekly homilies on iTunes and BulldogCatholic.org.",
        "views": "0",
        "likes": "0",
        "duration": "00:46:31",
        "genre": "religion",
        "video": "https://www.youtube.com/embed/yDnXk5iiCxM?start=",
        "showing": "2021-07-20 13:37:20",
        "time": "13:37:20",
        "language": "English",
        "year": "2021"
      },
      {
        "id": "7",
        "title": "Bob Ross - One Hour Special - The Grandeur of Summer",
        "channel": "WiiWatch",
        "image": "https://img.youtube.com/vi/mT0RNrTDHkI/0.jpg",
        "description": "Bob Ross, the host of television's favorite art show The Joy of Painting, paints one painting - Grandeur of Summer - with complete instructions for you to follow in this exclusive 60 minute video. Bob goes into the entire ''how to'' details for each painting providing you with excellent reference tools for your home studio. This episode was never seen on television!",
        "views": "0",
        "likes": "0",
        "duration": "00:59:42",
        "genre": "lifestyle",
        "video": "https://www.youtube.com/embed/mT0RNrTDHkI?start=",
        "showing": "2021-07-20 13:37:20",
        "time": "13:37:20",
        "language": "English",
        "year": "2021"
      },
      {
        "id": "8",
        "title": "Amazing Wildlife of Botswana - 8K Nature Documentary Film (with music)",
        "channel": "WiiWatch",
        "image": "https://img.youtube.com/vi/GcRKREorGSc/0.jpg",
        "description": "Go on a virtual 1-hour safari tour without leaving your home. Discover amazing African wildlife and relax! Botswana represents the biggest number and widest range of wildlife! You will see majestic springboks peacefully grazing in the shade. You will also see other amazing wild animals and birds up close and different species of birds near the waterholes. Immerse yourself in the life of the wild world and learn more about African animals. You will have the opportunity to observe animals in the wild: watch how they hunt, feed, fight, rest, and get along with other species. Take in the views of the African savannas and listen to relaxing music in the background. Get up close and personal with beautiful wildlife, enjoy the stunning landscapes in 8K, and feel relaxed. Enjoy wild sighting and let your imagination to run to the wild! In this nature film you will see the most incredible and stunning animals & birds! These are some of them: Bat-eared fox, Black-backed jackal, Black-winged stilt, Blue wildebeest, Northern black korhaan, Ostrich, Cheetah, Lion, Yellow mongoose, Southern giraffe, Tawny eagle, Bushveld lizard, African fish eagle, Common hippopotamus, African elephant, Greater kudu, Abdim’s stork, Ground squirrel, Red hartebeest, Secretarybird, African openbill, Burchell’s zebra, Martial eagle, African wild dog, European bee-eater, Southern yellow-billed hornbill, and more!",
        "views": "0",
        "likes": "0",
        "duration": "1:18:43",
        "genre": "wildlife",
        "video": "https://www.youtube.com/embed/GcRKREorGSc?start=",
        "showing": "2021-07-20 13:37:20",
        "time": "13:37:20",
        "language": "English",
        "year": "2021"
      },
      {
        "id": "9",
        "title": "ONE HOUR Of Amazing Ocean Moments | BBC Earth",
        "channel": "WiiWatch",
        "image": "https://img.youtube.com/vi/CSgDjZ_Vv8g/0.jpg",
        "description": "From underwater hunts to dancing whales, here are some of our all-time favourite ocean moments.",
        "views": "0",
        "likes": "0",
        "duration": "1:00:36",
        "genre": "wildlife",
        "video": "https://www.youtube.com/embed/CSgDjZ_Vv8g?start=",
        "showing": "2021-07-20 13:37:20",
        "time": "13:37:20",
        "language": "English",
        "year": "2021"
      },
      {
        "id": "10",
        "title": "Wildlife Predators: Tiger, Lion, Leopard and Jaguar - The Four Big Cats | Free Documentary Nature",
        "channel": "WiiWatch",
        "image": "https://img.youtube.com/vi/UiFjONQDHNM/0.jpg",
        "description": "Tigers, Lions, Leopards and Jaguars … the four big cats that can roar. JUST BIG CATS takes you into the domains of the world’s largest felines to discover more about these magnificent carnivores and their fascinating lives. Travel the wilds of Africa, Asia and the Americas to watch these Apex Predators in action. While they share common features such as sharp claws, long tails and sleek, flexible bodies, each type of Big Cat has their own distinct set of attributes and behaviors, such as the famous stripes on a Tiger’s coat, the attractive rosettes spotting a Leopard’s fur and how Lions are social felines, living in groups called Prides. Let Big Cats astound you with their raw power, natural agility, cunning stealth and undeniable presence … qualities that have earned these formidable creatures’ global admiration for centuries.",
        "views": "0",
        "likes": "0",
        "duration": "1:00:36",
        "genre": "wildlife",
        "video": "https://www.youtube.com/embed/UiFjONQDHNM?start=",
        "showing": "2021-07-20 13:37:20",
        "time": "13:37:20",
        "language": "English",
        "year": "2021"
      },
      {
        "id": "11",
        "title": "Our Planet | From Deserts to Grasslands | FULL EPISODE | Netflix",
        "channel": "WiiWatch",
        "image": "https://img.youtube.com/vi/XmtXC_n6X6Q/0.jpg",
        "description": "Experience our planet's natural beauty and examine how climate change impacts all living creatures in this ambitious documentary of spectacular scope. In this episode:  Cameras follow desert elephants seeking sustenance, bison roaming North American grasslands and caterpillars living the good life underground.",
        "views": "0",
        "likes": "0",
        "duration": "00:50:54",
        "genre": "wildlife",
        "video": "https://www.youtube.com/embed/XmtXC_n6X6Q?start=",
        "showing": "2021-07-18 00:03:20",
        "time": "21:47:20",
        "language": "English",
        "year": "2021"
      },
      {
        "id": "12",
        "title": "Mountains (Full Episode) | Hostile Planet",
        "channel": "WiiWatch",
        "image": "https://img.youtube.com/vi/NcRifDitRnU/0.jpg",
        "description": "The highest mountains on Earth are home to snow leopards, golden eagles, mountain goats, barnacle goslings and gelada monkeys. But only the toughest can endure the extreme weather, scarce food and limited oxygen on these peaks. Using new technology to showcase never-before-filmed animal behavior, Hostile Planet provides unique access to one of the most extreme environments on the planet.",
        "views": "0",
        "likes": "0",
        "duration": "00:47:22",
        "genre": "wildlife",
        "video": "https://www.youtube.com/embed/NcRifDitRnU?start=",
        "showing": "2021-07-19 21:20:20",
        "time": "13:37:20",
        "language": "English",
        "year": "2021"
      },
      {
        "id": "13",
        "title": "Chelsea 4-2 Tottenham Hotspur | Full Match | Emirates FA Cup Classic | Emirates FA Cup 16/17",
        "channel": "WiiWatch",
        "image": "https://img.youtube.com/vi/vKE5U01hztw/0.jpg",
        "description": "Relive an incredible semi-final from the Emirates FA Cup, as Chelsea and Tottenham Hotspur face off at Wembley Stadium.",
        "views": "0",
        "likes": "0",
        "duration": "1:55:45",
        "genre": "sports",
        "video": "https://www.youtube.com/embed/vKE5U01hztw?start=",
        "showing": "2021-07-22 13:37:20",
        "time": "13:37:20",
        "language": "English",
        "year": "2021"
      },
      {
        "id": "14",
        "title": "FULL MATCH | The Blues Too Strong For Manchester United | Emirates FA Cup Semi-Final 2019-20",
        "channel": "WiiWatch",
        "image": "https://img.youtube.com/vi/fCG2ENyzbEA/0.jpg",
        "description": "Join us for the last of our full match premieres ahead of the Emirates FA Cup semi-final weekend, as we look back at last year's semi-final to see how Chelsea secured their place in the Heads Up FA Cup Final under Frank Lampard.",
        "views": "0",
        "likes": "0",
        "duration": "1:53:12",
        "genre": "sports",
        "video": "https://www.youtube.com/embed/fCG2ENyzbEA?start=",
        "showing": "2021-07-20 13:37:20",
        "time": "13:37:20",
        "language": "English",
        "year": "2021"
      },
      {
        "id": "15",
        "title": "Will Canada require mandatory COVID-19 vaccinations for health workers like France and Greece?",
        "channel": "WiiWatch",
        "image": "https://img.youtube.com/vi/FX4V4Kj5VKM/0.jpg",
        "description": "France and Greece have both introduced mandatory vaccines for health-care workers amid concerns about the Delta variant. In Canada, COVID-19 infections are lower and vaccination rates are higher, but there is still a push to get everyone inoculated against the disease. Only a few provinces in Canada have mandated vaccines to certain health-care workers. But will a federal mandate be put into place? Abigail Bimman explains.",
        "views": "0",
        "likes": "0",
        "duration": "00:02:14",
        "genre": "health",
        "video": "https://www.youtube.com/embed/FX4V4Kj5VKM/?start=",
        "showing": "2021-07-19 21:36:00",
        "time": "17:34:10",
        "language": "English",
        "year": "2021"
      },
      {
        "id": "16",
        "title": "Algorithms and Data Structures - Full Course for Beginners from Treehouse",
        "channel": "WiiWatch",
        "image": "https://img.youtube.com/vi/8hly31xKli0/0.jpg",
        "description": "In this course you will learn about algorithms and data structures, two of the fundamental topics in computer science. There are three main parts to this course: algorithms, data structures, and a deep dive into sorting and searching algorithms. By the end, you will understand what algorithms and data structures are, how they are measured and evaluated, and how they are used to solve problems.",
        "views": "0",
        "likes": "0",
        "duration": "05:22:08",
        "genre": "tech",
        "video": "https://www.youtube.com/embed/8hly31xKli0/?start=",
        "showing": "2021-07-20 19:48:10",
        "time": "17:40:10",
        "language": "English",
        "year": "2021"
      }
   
  ]